Revit 2026 API

# BoundaryConditionsGetLoops Method

---

Returns curve loops that define geometry of the area boundary conditions.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<CurveLoop> GetLoops()
```
```vb
Public Function GetLoops As IList(Of CurveLoop)
```
```cpp
public:
IList<CurveLoop^>^ GetLoops()
```
```fsharp
member GetLoops : unit -> IList<CurveLoop>
```

#### Return Value

IListCurveLoop The curve loop collection.

| Exception | Condition |
| --- | --- |
| InvalidObjectException | Thrown when BoundaryConditions is not a BoundaryConditionsType::Area type. |

Boundary conditions should be BoundaryConditionsType::Area type. Otherwise exception is thrown.

#### Reference

BoundaryConditions Class

Autodesk.Revit.DB.Structure Namespace